; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action pickup2
  :parameters (?ob ?overob)
  :precondition (and (on ?overob ?ob) (clear ?overob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (on-table ?overob) 
               (not (on ?overob ?ob)) (not (arm-empty)) (not (on-table ?ob))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty))))

(:action unstack2
  :parameters (?ob ?overob ?underob)
  :precondition (and (on ?ob ?underob) (on ?overob ?ob) (clear ?overob) (arm-empty))
  :effect (and (holding ?ob) (on ?overob ?underob)
               (not (on ?ob ?underob)) (not (on ?overob ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-10)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 )
(:init
(arm-empty)
(on b1 b8)
(on b2 b6)
(on b3 b2)
(on b4 b7)
(on b5 b9)
(on b6 b10)
(on b7 b1)
(on b8 b5)
(on-table b9)
(on-table b10)
(clear b3)
(clear b4)
)
(:goal
(and
(on b1 b10)
(on b2 b3)
(on b4 b6)
(on b9 b7)
(on b10 b2))
)
)

; plan
1. (unstack b3 b2)
   deleted: (on b3 b2) (clear b3) (arm-empty)
   added: (holding b3) (clear b2)
   goals met: 0 of 5
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 5
3. (unstack b2 b6)
   deleted: (on b2 b6) (clear b2) (arm-empty)
   added: (holding b2) (clear b6)
   goals met: 0 of 5
4. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 1 of 5
5. (pickup2 b10 b6)
   deleted: (on b6 b10) (arm-empty) (on-table b10)
   added: (holding b10) (on-table b6)
   goals met: 1 of 5
6. (stack b10 b2)
   deleted: (clear b2) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b2)
   goals met: 2 of 5
7. (unstack b4 b7)
   deleted: (on b4 b7) (clear b4) (arm-empty)
   added: (holding b4) (clear b7)
   goals met: 2 of 5
8. (stack b4 b6)
   deleted: (clear b6) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b6)
   goals met: 3 of 5
9. (unstack2 b1 b7 b8)
   deleted: (on b1 b8) (on b7 b1) (arm-empty)
   added: (holding b1) (on b7 b8)
   goals met: 3 of 5
10. (stack b1 b10)
   deleted: (clear b10) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b10)
   goals met: 4 of 5
11. (unstack b7 b8)
   deleted: (on b7 b8) (clear b7) (arm-empty)
   added: (holding b7) (clear b8)
   goals met: 4 of 5
12. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 4 of 5
13. (unstack2 b5 b8 b9)
   deleted: (on b5 b9) (on b8 b5) (arm-empty)
   added: (holding b5) (on b8 b9)
   goals met: 4 of 5
14. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 4 of 5
15. (pickup2 b9 b8)
   deleted: (on b8 b9) (arm-empty) (on-table b9)
   added: (holding b9) (on-table b8)
   goals met: 4 of 5
16. (stack b9 b7)
   deleted: (clear b7) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b7)
   goals met: 5 of 5
